                                                //الطريقه الاولى "ASCII"
// الفرق بين 'a' و 'A' في الـ ASCII هو 32"
// الحروف الكابيتال أرقامها أصغر في الجدول. 
// (مثلاً: 'A' قيمتها 65).
// الحروف السمول أرقامها أكبر في الجدول.
// (مثلاً: 'a' قيمتها 97)
//  .لو طرحنا $97 - 65$ الناتج هيطلع فعلاً 32!
//  لو معاكي حرف كابيتال وعايزة تحوليه لـ سمول: هـ تجمعي عليه 32. (X + 32)
// لو معاكي حرف سمول وعايزة تحوليه لـ كابيتال: هـ تطرحي منه 32. (X - 32)

// #include<iostream>
// using namespace std;
// int main(){
//     char X;
//     cin>>X;
//     if(X>= 'A' && X<='Z'){
//         cout << (char)(X + 32) << endl;
//     }
//     else if(X>='a' && X<='z'){
//         cout << (char)(X - 32) << endl;
//     }

// }
                                          //***************************************
                                          //الطريقة التانيه بيلد ان فانكشنز 
// #include<iostream>
// #include<cctype>
// using namespace std;
// int main(){
//     char X;
//     cin>>X;
//     if (X >= 'A' && X <= 'Z') {
//     cout << (char)tolower(X) << endl;
// } 
// else {
//     cout << (char)toupper(X) << endl;
// }
// }                                          